/*******************************************************************************
  * Company: Wang Electronic Technology Co., Ltd.
  ******************************************************************************
  * 文件名称：main.c
  * 功能说明：CAN通信滤波
  * 版    本：V1.1
	* 作    者：jeansonm
  * 日    期：2014-4-18
********************************************************************************
  * 文件名称：
  * 功能说明：
  * 版    本：
	* 更新作者:	
  * 日    期：
	* 更新原因：
********************************************************************************/
#include "lpc17xx.h"
#include "can.h"
#include "uart.h"

/*********************************************************************************************************
** Function name:       DACInit
** Descriptions:        DAC引脚初始化
** input parameters:    无
** output parameters:   无
** Returned value:      无
*********************************************************************************************************/

/*****************************************************************************
**   Main Function  main()
******************************************************************************/
int main(void)
{
	uint8_t       i = 0;
	SystemInit();		  			//初始化目标板，切勿删除 
		
	CAN_setup(CAN1);       	//设置CAN控制器1  
	CAN_start(CAN1);       	//启动CAN控制器1           
	CAN_waitReady(CAN1);   	//等待CAN控制器1就绪   
	
	CAN_SetACCF(ACCF_ON);		//初始化使能滤波

	CAN_TxMsg[CAN1].id     = 22; //初始化帧信息 
	CAN_TxMsg[CAN1].len    = 1;
	CAN_TxMsg[CAN1].format = STANDARD_FORMAT;
	CAN_TxMsg[CAN1].type   = DATA_FRAME; 
	for (i = 0; i < 8; i++)
	{
			CAN_TxMsg[CAN1].data[i] = 0;
	}	

		UART2_Init(9600);						//串口2初始化
		UART2_SendString("*** CAN Test ***\r\n");

		while (1) 
		{
		} 
}
/******************************************************************************
**                            End Of File
******************************************************************************/
